Revit 2027 API
EnergyDataSettings.CheckServiceType Method
 Checks that the service type falls within an appropriate range.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CheckServiceType(
	gbXMLServiceType serviceType
)
Public Shared Function CheckServiceType (
	serviceType As gbXMLServiceType
) As Boolean
public:
static bool CheckServiceType(
	gbXMLServiceType serviceType
)
static member CheckServiceType :
        serviceType : gbXMLServiceType -> bool
Parameters
serviceType gbXMLServiceType
 The service type to be checked.
Return Value
Boolean
 True if the service type falls within an appropriate range, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace